
-- --------------------------------------------------------

--
-- Структура таблицы `cities`
--

CREATE TABLE `cities` (
  `id` int(11) UNSIGNED NOT NULL,
  `country_id` int(11) UNSIGNED NOT NULL,
  `important` tinyint(1) NOT NULL,
  `region_id` int(11) UNSIGNED NOT NULL,
  `title` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `cities`
--

INSERT INTO `cities` (`id`, `country_id`, `important`, `region_id`, `title`) VALUES
(1, 643, 0, 50, 'Балашиха'),
(2, 643, 0, 50, 'Апрелевка'),
(3, 643, 0, 50, 'Волоколамск'),
(4, 643, 0, 33, 'Владимир'),
(5, 643, 0, 33, 'Ковров'),
(6, 643, 0, 33, 'Лакинск'),
(7, 840, 0, 19, 'Ковингтон'),
(8, 840, 0, 19, 'Лексингтон'),
(9, 840, 0, 19, 'Форт-Томас'),
(10, 840, 0, 31, 'Майями'),
(11, 840, 0, 31, 'Орландо'),
(12, 840, 0, 38, 'Манхэттен'),
(13, 840, 0, 38, 'Лоренс'),
(14, 392, 0, 2, 'Фукусима'),
(15, 392, 0, 2, 'Ивате'),
(16, 392, 0, 3, 'Токио'),
(17, 392, 0, 3, 'Канагава'),
(18, 156, 0, 16, 'Хайдун'),
(19, 156, 0, 16, 'Синин'),
(20, 156, 0, 10, 'Чэндэ'),
(21, 156, 0, 10, 'Таншань');
