
-- --------------------------------------------------------

--
-- Структура таблицы `staff`
--

CREATE TABLE `staff` (
  `id` int(11) UNSIGNED NOT NULL,
  `name` varchar(25) COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_name` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `department` int(11) UNSIGNED NOT NULL,
  `position` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `salary` int(11) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `staff`
--

INSERT INTO `staff` (`id`, `name`, `last_name`, `department`, `position`, `salary`) VALUES
(1, 'Самуил', 'Бобырев', 8, 'Охранник', 40000),
(3, 'Петр', 'Гришин', 1, 'Финансовый директор', 105000),
(4, 'Андрей', 'Меркушев', 2, 'Руководитель отдела кадров', 95000),
(5, 'Ольга', 'Богданова', 3, 'Главный бухгалтер', 90000),
(6, 'Оксана', 'Никонова', 3, 'Бухгалтер', 50000),
(7, 'Елена', 'Чернова', 4, 'Юрист', 60000),
(8, 'Глория', 'Кириллова', 5, 'Верстальщик', 50000),
(9, 'Петр', 'Громов', 5, 'Фронтэнд программист', 80000),
(10, 'Кирилл', 'Евсеев', 5, 'Бэкэнд программист', 80000),
(11, 'Дмитрий', 'Сорокин', 6, 'Маркетолог', 60000),
(12, 'Яна', 'Щербакова', 7, 'Менеджер по продажам', 50000),
(13, 'Кристина', 'Доронина', 7, 'Менеджер по продажам', 50000),
(14, 'Арсений', 'Голубев', 8, 'Начальник охраны', 80000),
(15, 'Самуил', 'Бобырев', 8, 'Охранник', 40000),
(16, 'Иван', 'Мартынов', 1, 'Генеральный директор', 110000);
